export const PrefectureOptions = [
    "北海道",
    "青森県",
    "岩手県",
    "宮城県",
    "秋田県",
    "山形県",
    "福島県",
    "茨城県",
    "栃木県",
    "群馬県",
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "山梨県",
    "長野県",
    "静岡県",
    "新潟県",
    "富山県",
    "石川県",
    "福井県",
    "岐阜県",
    "愛知県",
    "三重県",
    "滋賀県",
    "京都府",
    "大阪府",
    "兵庫県",
    "奈良県",
    "和歌山県",
    "鳥取県",
    "島根県",
    "岡山県",
    "広島県",
    "山口県",
    "徳島県",
    "香川県",
    "愛媛県",
    "高知県",
    "福岡県",
    "佐賀県",
    "長崎県",
    "熊本県",
    "大分県",
    "宮崎県",
    "鹿児島県",
    "沖縄県",
];

export const JaArea = ["道央", "道南", "道北", "道東"];

export const JaPromotionBureau = [
    { value: "石狩振興局", parent: "道央" },
    { value: "空知総合振興局", parent: "道央" },
    { value: "後志総合振興局", parent: "道央" },

    { value: "渡島総合振興局・檜山振興局", parent: "道南" },
    { value: "胆振総合振興局", parent: "道南" },
    { value: "日高振興局", parent: "道南" },

    { value: "上川総合振興局", parent: "道北" },
    { value: "留萌振興局", parent: "道北" },
    { value: "宗谷総合振興局", parent: "道北" },

    { value: "オホーツク総合振興局", parent: "道東" },
    { value: "十勝総合振興局", parent: "道東" },
    { value: "釧路総合振興局", parent: "道東" },
    { value: "根室振興局", parent: "道東" },
];

export const ServiceCenterOption = [
    { value: "空知農業改良普及センター（本所）（そらち）", parent: "北海道" },
    {
        value: "空知農業改良普及センター空知南東部支所（そらちなんとうぶ）",
        parent: "北海道",
    },
    {
        value: "空知農業改良普及センター空知南西部支所（そらちなんせいぶ）",
        parent: "北海道",
    },
    {
        value: "空知農業改良普及センター中空知支所（なかそらち）",
        parent: "北海道",
    },
    {
        value: "空知農業改良普及センター北空知支所（きたそらち）",
        parent: "北海道",
    },
    {
        value: "石狩農業改良普及センター（本所）（いしかり）",
        parent: "北海道",
    },
    {
        value: "石狩農業改良普及センター石狩北部支所（いしかりほくぶ）",
        parent: "北海道",
    },
    {
        value: "後志農業改良普及センター（本所）（しりべし）",
        parent: "北海道",
    },
    {
        value: "後志農業改良普及センター北後志支所（きたしりべし）",
        parent: "北海道",
    },
    {
        value: "胆振農業改良普及センター本所（いぶり）",
        parent: "北海道",
    },
    {
        value: "胆振農業改良普及センター東胆振支所（ひがしいぶり）",
        parent: "北海道",
    },
    {
        value: "胆振農業改良普及センター東胆振支所（ひがしいぶり）",
        parent: "北海道",
    },
    {
        value: "日高農業改良普及センター日高西部支所（ひだかせいぶ）",
        parent: "北海道",
    },
    {
        value: "渡島農業改良普及センター本所（おしま）",
        parent: "北海道",
    },
    {
        value: "渡島農業改良普及センター渡島北部支所（おしまほくぶ）",
        parent: "北海道",
    },
    {
        value: "檜山農業改良普及センター本所（ひやま）",
        parent: "北海道",
    },
    {
        value: "檜山農業改良普及センター檜山北部支所（ひやまほくぶ）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター本所（かみかわ）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター富良野支所（ふらの）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター大雪支所（たいせつ）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター士別支所（しべつ）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター名寄支所（なよろ）",
        parent: "北海道",
    },
    {
        value: "上川農業改良普及センター上川北部支所（かみかわほくぶ）",
        parent: "北海道",
    },
    {
        value: "留萌農業改良普及センター本所（るもい）",
        parent: "北海道",
    },
    {
        value: "留萌農業改良普及センター南留萌支所（みなみるもい）",
        parent: "北海道",
    },
    {
        value: "宗谷農業改良普及センター本所（そうや）",
        parent: "北海道",
    },
    {
        value: "宗谷農業改良普及センター宗谷北部支所（そうやほくぶ）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター本所（あばしり）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター清里支所（きよさと）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター網走支所（あばしり）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター美幌支所（びほろ）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター遠軽支所（えんがる）",
        parent: "北海道",
    },
    {
        value: "網走農業改良普及センター紋別支所（もんべつ）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター本所（とかち）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター十勝東部支所（とかちとうぶ）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター十勝東北部支所（とかちとうほくぶ）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター十勝北部支所（とかちほくぶ）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター十勝西部支所（とかちせいぶ）",
        parent: "北海道",
    },
    {
        value: "十勝農業改良普及センター十勝南部支所（とかちなんぶ）",
        parent: "北海道",
    },
    {
        value: "釧路農業改良普及センター本所（くしろ）",
        parent: "北海道",
    },
    {
        value: "釧路農業改良普及センター釧路東部支所（くしろとうぶ）",
        parent: "北海道",
    },
    {
        value: "釧路農業改良普及センター釧路中西部支所（くしろちゅうせいぶ）",
        parent: "北海道",
    },
    {
        value: "根室農業改良普及センター本所（ねむろ）",
        parent: "北海道",
    },
    {
        value: "根室農業改良普及センター北根室支所（きたねむろ）",
        parent: "北海道",
    },

    {
        value: "東青地域県民局地域農林水産部農業普及振興室（とうせい）",
        parent: "青森県",
    },
    {
        value: "中南地域県民局地域農林水産部農業普及振興室（ちゅうなん）",
        parent: "青森県",
    },
    {
        value: "三八地域県民局地域農林水産部農業普及振興室（さんはち）",
        parent: "青森県",
    },
    {
        value: "西北地域県民局地域農林水産部農業普及振興室（せいほく）",
        parent: "青森県",
    },
    {
        value: "上北地域県民局地域農林水産部農業普及振興室（かみきた）",
        parent: "青森県",
    },
    {
        value: "下北地域県民局地域農林水産部農業普及振興室（しもきた）",
        parent: "青森県",
    },

    {
        value: "盛岡農業改良普及センター（もりおか）",
        parent: "岩手県",
    },
    {
        value: "八幡平農業改良普及センター（はちまんたい）",
        parent: "岩手県",
    },
    {
        value: "中部農業改良普及センター（ちゅうぶ）",
        parent: "岩手県",
    },
    {
        value: "奥州農業改良普及センター（おうしゅう）",
        parent: "岩手県",
    },
    {
        value: "一関農業改良普及センター（いちのせき）",
        parent: "岩手県",
    },
    {
        value: "大船渡農業改良普及センター（おおふなと）",
        parent: "岩手県",
    },
    {
        value: "宮古農業改良普及センター（みやこ）",
        parent: "岩手県",
    },
    {
        value: "久慈農業改良普及センター（くじ）",
        parent: "岩手県",
    },
    {
        value: "二戸農業改良普及センター（にのへ）",
        parent: "岩手県",
    },

    {
        value: "大河原地方振興事務所農業振興部（大河原農業改良普及センター）（おおがわら）",
        parent: "宮城県",
    },
    {
        value: "仙台地方振興事務所農業振興部（亘理農業改良普及センター）（わたり）",
        parent: "宮城県",
    },
    {
        value: "仙台地方振興事務所農業振興部（仙台農業改良普及センター）（せんだい）",
        parent: "宮城県",
    },
    {
        value: "北部地方振興事務所農業振興部（大崎農業改良普及センター）（おおさき）",
        parent: "宮城県",
    },
    {
        value: "北部地方振興事務所農業振興部（美里農業改良普及センター）（みさと）",
        parent: "宮城県",
    },
    {
        value: "北部地方振興事務所栗原地域事務所農業振興部（栗原農業改良普及センター）（くりはら）",
        parent: "宮城県",
    },
    {
        value: "東部地方振興事務所登米地域事務所農業振興部（登米農業改良普及センター）（とめ）",
        parent: "宮城県",
    },
    {
        value: "東部地方振興事務所農業振興部（石巻農業改良普及センター）（とうぶ）",
        parent: "宮城県",
    },
    {
        value: "気仙沼地方振興事務所農業振興部（気仙沼農業改良普及センター）（けせんぬま）",
        parent: "宮城県",
    },

    {
        value: "鹿角地域振興局農林部農業振興普及課（かづの）",
        parent: "秋田県",
    },
    {
        value: "北秋田地域振興局農林部農業振興普及課（きたあきた）",
        parent: "秋田県",
    },
    {
        value: "山本地域振興局農林部農業振興普及課（やまもと）",
        parent: "秋田県",
    },
    {
        value: "秋田地域振興局農林部農業振興普及課（あきた）",
        parent: "秋田県",
    },
    {
        value: "由利地域振興局農林部農業振興普及課（ゆり）",
        parent: "秋田県",
    },
    {
        value: "仙北地域振興局農林部農業振興普及課（せんぼく）",
        parent: "秋田県",
    },
    {
        value: "平鹿地域振興局農林部農業振興普及課（ひらか）",
        parent: "秋田県",
    },
    {
        value: "雄勝地域振興局農林部農業振興普及課（おがち）",
        parent: "秋田県",
    },

    {
        value: "村山総合支庁産業経済部農業技術普及課（むらやま）",
        parent: "山形県",
    },
    {
        value: "村山総合支庁産業経済部西村山農業技術普及課（にしむらやま）",
        parent: "山形県",
    },
    {
        value: "村山総合支庁産業経済部北村山農業技術普及課（きたむらやま）",
        parent: "山形県",
    },
    {
        value: "最上総合支庁産業経済部農業技術普及課（もがみ）",
        parent: "山形県",
    },
    {
        value: "置賜総合支庁産業経済部農業技術普及課（おきたま）",
        parent: "山形県",
    },
    {
        value: "置賜総合支庁産業経済部西置賜農業技術普及課（にしおきたま）",
        parent: "山形県",
    },
    {
        value: "庄内総合支庁産業経済部農業技術普及課（しょうない）",
        parent: "山形県",
    },
    {
        value: "庄内総合支庁産業経済部酒田農業技術普及課（さかた）",
        parent: "山形県",
    },

    {
        value: "県北農林事務所農業振興普及部（けんぽく）",
        parent: "福島県",
    },
    {
        value: "県北農林事務所伊達農業普及所（だて）",
        parent: "福島県",
    },
    {
        value: "県北農林事務所安達農業普及所（あだち）",
        parent: "福島県",
    },
    {
        value: "県中農林事務所農業振興普及部（けんちゅう）",
        parent: "福島県",
    },
    {
        value: "県中農林事務所田村農業普及所（たむら）",
        parent: "福島県",
    },
    {
        value: "県中農林事務所須賀川農業普及所（すかがわ）",
        parent: "福島県",
    },
    {
        value: "県南農林事務所農業振興普及部（けんなん）",
        parent: "福島県",
    },
    {
        value: "会津農林事務所農業振興普及部（あいづ）",
        parent: "福島県",
    },
    {
        value: "会津農林事務所喜多方農業普及所（きたかた）",
        parent: "福島県",
    },
    {
        value: "会津農林事務所会津坂下農業普及所（あいづばんげ）",
        parent: "福島県",
    },
    {
        value: "南会津農林事務所農業振興普及部（みなみあいづ）",
        parent: "福島県",
    },
    {
        value: "相双農林事務所農業振興普及部（そうそう）",
        parent: "福島県",
    },
    {
        value: "相双農林事務所双葉農業普及所（ふたば）",
        parent: "福島県",
    },
    {
        value: "いわき農林事務所農業振興普及部",
        parent: "福島県",
    },

    {
        value: "県北農林事務所　経営・普及部門（常陸太田地域農業改良普及センター）（ひたちおおた）",
        parent: "茨城県",
    },
    {
        value: "県北農林事務所　常陸大宮地域農業改良普及センター（ひたちおおみや）",
        parent: "茨城県",
    },
    {
        value: "県央農林事務所　経営・普及部門（水戸地域農業改良普及センター）（みと）",
        parent: "茨城県",
    },
    {
        value: "県央農林事務所　笠間地域農業改良普及センター（かさま）",
        parent: "茨城県",
    },
    {
        value: "鹿行農林事務所　経営・普及部門（鉾田地域農業改良普及センター）（ほこた）",
        parent: "茨城県",
    },
    {
        value: "鹿行農林事務所　行方地域農業改良普及センター（なめがた）",
        parent: "茨城県",
    },
    {
        value: "県南農林事務所　経営・普及部門（土浦地域農業改良普及センター）（つちうら）",
        parent: "茨城県",
    },
    {
        value: "県南農林事務所　稲敷地域農業改良普及センター（いなしき）",
        parent: "茨城県",
    },
    {
        value: "県南農林事務所　つくば地域農業改良普及センター（つくば）",
        parent: "茨城県",
    },
    {
        value: "県西農林事務所　経営・普及部門（筑西地域農業改良普及センター）（ちくせい）",
        parent: "茨城県",
    },
    {
        value: "県西農林事務所　結城地域農業改良普及センター（ゆうき）",
        parent: "茨城県",
    },
    {
        value: "県西農林事務所　坂東地域農業改良普及センター（ばんどう）",
        parent: "茨城県",
    },

    {
        value: "河内農業振興事務所経営普及部（かわち）",
        parent: "栃木県",
    },
    {
        value: "上都賀農業振興事務所経営普及部（かみつが）",
        parent: "栃木県",
    },
    {
        value: "芳賀農業振興事務所経営普及部（はが）",
        parent: "栃木県",
    },
    {
        value: "下都賀農業振興事務所経営普及部（しもつが）",
        parent: "栃木県",
    },
    {
        value: "塩谷南那須農業振興事務所経営普及部（しおやみなみなす）",
        parent: "栃木県",
    },
    {
        value: "那須農業振興事務所経営普及部（なす）",
        parent: "栃木県",
    },
    {
        value: "安足農業振興事務所経営普及部（あんそく）",
        parent: "栃木県",
    },

    {
        value: "中部農業事務所普及指導課（ちゅうぶ）",
        parent: "群馬県",
    },
    {
        value: "中部農業事務所渋川地区農業指導センター（ちゅうぶ・しぶかわ）",
        parent: "群馬県",
    },
    {
        value: "中部農業事務所伊勢崎地区農業指導センター（ちゅうぶ・いせさき）",
        parent: "群馬県",
    },
    {
        value: "西部農業事務所普及指導課（せいぶ）",
        parent: "群馬県",
    },
    {
        value: "西部農業事務所藤岡地区農業指導センター（せいぶ・ふじおか）",
        parent: "群馬県",
    },
    {
        value: "西部農業事務所富岡地区農業指導センター（せいぶ・とみおか）",
        parent: "群馬県",
    },
    {
        value: "吾妻農業事務所普及指導課（あがつま）",
        parent: "群馬県",
    },
    {
        value: "利根沼田農業事務所普及指導課（とねぬまた）",
        parent: "群馬県",
    },
    {
        value: "東部農業事務所普及指導課（とうぶ）",
        parent: "群馬県",
    },
    {
        value: "東部農業事務所桐生地区農業指導センター（とうぶ・きりゅう）",
        parent: "群馬県",
    },
    {
        value: "東部農業事務所館林地区農業指導センター（とうぶ・たてばやし）",
        parent: "群馬県",
    },

    {
        value: "さいたま農林振興センター（さいたま）",
        parent: "埼玉県",
    },
    {
        value: "川越農林振興センター（かわごえ）",
        parent: "埼玉県",
    },
    {
        value: "東松山農林振興センター（ひがしまつやま）",
        parent: "埼玉県",
    },
    {
        value: "東松山農林振興センター（ひがしまつやま）",
        parent: "埼玉県",
    },
    {
        value: "本庄農林振興センター（ほんじょう）",
        parent: "埼玉県",
    },
    {
        value: "大里農林振興センター（おおさと）",
        parent: "埼玉県",
    },
    {
        value: "加須農林振興センター（かぞ）",
        parent: "埼玉県",
    },
    {
        value: "春日部農林振興センター（かすかべ）",
        parent: "埼玉県",
    },

    {
        value: "千葉農業事務所改良普及課（ちば）",
        parent: "千葉県",
    },
    {
        value: "東葛飾農業事務所改良普及課（ひがしかつしか）",
        parent: "千葉県",
    },
    {
        value: "印旛農業事務所改良普及課（いんば）",
        parent: "千葉県",
    },
    {
        value: "香取農業事務所改良普及課（かとり）",
        parent: "千葉県",
    },
    {
        value: "海匝農業事務所改良普及課（かいそう）",
        parent: "千葉県",
    },
    {
        value: "山武農業事務所改良普及課（さんぶ）",
        parent: "千葉県",
    },
    {
        value: "長生農業事務所改良普及課（ちょうせい）",
        parent: "千葉県",
    },
    {
        value: "夷隅農業事務所改良普及課（いすみ）",
        parent: "千葉県",
    },
    {
        value: "安房農業事務所改良普及課（あわ）",
        parent: "千葉県",
    },
    {
        value: "君津農業事務所改良普及課（きみつ）",
        parent: "千葉県",
    },

    {
        value: "農業振興事務所　中央農業改良普及センター（ちゅうおう",
        parent: "東京都",
    },
    {
        value: "農業振興事務所　西多摩農業改良普及センター（にしたま）",
        parent: "東京都",
    },
    {
        value: "農業振興事務所　南多摩農業改良普及センター（みなみたま）",
        parent: "東京都",
    },
    {
        value: "島しょ農林水産総合センター　大島事業所普及指導センター（おおしま）",
        parent: "東京都",
    },
    {
        value: "島しょ農林水産総合センター　三宅事業所普及指導センター（みやけ）",
        parent: "東京都",
    },
    {
        value: "島しょ農林水産総合センター　八丈事業所普及指導センター（はちじょう）",
        parent: "東京都",
    },

    {
        value: "農業技術センター",
        parent: "神奈川県",
    },
    {
        value: "農業技術センター横浜川崎地区事務所（よこはまかわさき）",
        parent: "神奈川県",
    },
    {
        value: "農業技術センター北相地区事務所（ほくそう）",
        parent: "神奈川県",
    },
    {
        value: "農業技術センター三浦半島地区事務所（みうらはんとう）",
        parent: "神奈川県",
    },
    {
        value: "農業技術センター足柄地区事務所（あしがら）",
        parent: "神奈川県",
    },
    {
        value: "畜産技術センター",
        parent: "神奈川県",
    },

    {
        value: "中北農務事務所農業農村支援課（ちゅうほく）",
        parent: "山梨県",
    },
    {
        value: "峡東農務事務所農業農村支援課（きょうとう）",
        parent: "山梨県",
    },
    {
        value: "峡南農務事務所農業農村支援課（きょうなん）",
        parent: "山梨県",
    },
    {
        value: "富士・東部農務事務所農業農村支援課（ふじ・とうぶ）",
        parent: "山梨県",
    },

    {
        value: "佐久農業農村支援センター（さく）",
        parent: "長野県",
    },
    {
        value: "上田農業農村支援センター（うえだ）",
        parent: "長野県",
    },
    {
        value: "諏訪農業農村支援センター（すわ）",
        parent: "長野県",
    },
    {
        value: "上伊那農業農村支援センター（かみいな）",
        parent: "長野県",
    },
    {
        value: "南信州農業農村支援センター（みなみしんしゅう）",
        parent: "長野県",
    },
    {
        value: "木曽農業農村支援センター（きそ）",
        parent: "長野県",
    },
    {
        value: "松本農業農村支援センター（まつもと）",
        parent: "長野県",
    },
    {
        value: "北アルプス農業農村支援センター（きたアルプス）",
        parent: "長野県",
    },
    {
        value: "長野農業農村支援センター（ながの）",
        parent: "長野県",
    },
    {
        value: "北信農業農村支援センター（ほくしん）",
        parent: "長野県",
    },

    {
        value: "賀茂農林事務所（かも）",
        parent: "静岡県",
    },
    {
        value: "東部農林事務所（とうぶ）",
        parent: "静岡県",
    },
    {
        value: "富士農林事務所（ふじ）",
        parent: "静岡県",
    },
    {
        value: "中部農林事務所（ちゅうぶ）",
        parent: "静岡県",
    },
    {
        value: "志太榛原農林事務所（しだはいばら）",
        parent: "静岡県",
    },
    {
        value: "中遠農林事務所（ちゅうえん）",
        parent: "静岡県",
    },
    {
        value: "西部農林事務所（せいぶ）",
        parent: "静岡県",
    },

    {
        value: "村上地域振興局農林振興部（村上農業普及指導センター）（むらかみ）",
        parent: "新潟県",
    },
    {
        value: "新発田地域振興局農業振興部（新発田農業普及指導センター）（しばた）",
        parent: "新潟県",
    },
    {
        value: "新潟地域振興局農林振興部（新潟農業普及指導センター）（にいがた）",
        parent: "新潟県",
    },
    {
        value: "新潟地域振興局巻農業振興部（巻農業普及指導センター）（まき）",
        parent: "新潟県",
    },
    {
        value: "三条地域振興局農業振興部（三条農業普及指導センター）（さんじょう）",
        parent: "新潟県",
    },
    {
        value: "長岡地域振興局農林振興部（長岡農業普及指導センター）（ながおか）",
        parent: "新潟県",
    },
    {
        value: "魚沼地域振興局農業振興部（魚沼農業普及指導センター）（うおぬま）",
        parent: "新潟県",
    },
    {
        value: "南魚沼地域振興局農林振興部（南魚沼農業普及指導センター）（みなみうおぬま）",
        parent: "新潟県",
    },
    {
        value: "十日町地域振興局農業振興部（十日町農業普及指導センター）（とおかまち）",
        parent: "新潟県",
    },
    {
        value: "柏崎地域振興局農業振興部（柏崎農業普及指導センター）（かしわざき）",
        parent: "新潟県",
    },
    {
        value: "上越地域振興局農林振興部（上越農業普及指導センター）（じょうえつ）",
        parent: "新潟県",
    },
    {
        value: "糸魚川地域振興局農林振興部（糸魚川農業普及指導センター）（いといがわ）",
        parent: "新潟県",
    },
    {
        value: "佐渡地域振興局農林水産振興部（佐渡農業普及指導センター）（さど）",
        parent: "新潟県",
    },

    {
        value: "新川農林振興センター（にいかわ）",
        parent: "富山県",
    },
    {
        value: "富山農林振興センター（とやま）",
        parent: "富山県",
    },
    {
        value: "高岡農林振興センター（たかおか）",
        parent: "富山県",
    },
    {
        value: "砺波農林振興センター（となみ）",
        parent: "富山県",
    },

    {
        value: "南加賀農林総合事務所　加賀農林事務所地域農業振興課（かが）",
        parent: "石川県",
    },
    {
        value: "南加賀農林総合事務所　農業振興部（みなみかが）",
        parent: "石川県",
    },
    {
        value: "石川農林総合事務所　農業振興部（いしかわ）",
        parent: "石川県",
    },
    {
        value: "県央農林総合事務所　農業振興部（けんおう）",
        parent: "石川県",
    },
    {
        value: "県央農林総合事務所　津幡農林事務所地域農業振興課（つばた）",
        parent: "石川県",
    },
    {
        value: "中能登農林総合事務所　羽咋農林事務所地域農業振興課（はくい）",
        parent: "石川県",
    },
    {
        value: "中能登農林総合事務所　農業振興部（なかのと）",
        parent: "石川県",
    },
    {
        value: "奥能登農林総合事務所　農業振興部（おくのと）",
        parent: "石川県",
    },
    {
        value: "奥能登農林総合事務所　珠洲農林事務所地域農業振興課（すず）",
        parent: "石川県",
    },

    {
        value: "福井農林総合事務所農業経営支援部（ふくい）",
        parent: "福井県",
    },
    {
        value: "坂井農林総合事務所農業経営支援部（さかい）",
        parent: "福井県",
    },
    {
        value: "奥越農林総合事務所農業経営支援部（おくえつ）",
        parent: "福井県",
    },
    {
        value: "丹南農林総合事務所農業経営支援部（たんなん）",
        parent: "福井県",
    },
    {
        value: "嶺南振興局二州農林部技術経営支援課（にしゅう）",
        parent: "福井県",
    },
    {
        value: "嶺南振興局農業経営支援部（れいなん）",
        parent: "福井県",
    },

    {
        value: "岐阜農林事務所農業普及課（ぎふ）",
        parent: "岐阜県",
    },
    {
        value: "西濃農林事務所農業普及課（せいのう）",
        parent: "岐阜県",
    },
    {
        value: "揖斐農林事務所農業普及課（いび）",
        parent: "岐阜県",
    },
    {
        value: "中濃農林事務所農業普及課（ちゅうのう）",
        parent: "岐阜県",
    },
    {
        value: "郡上農林事務所農業振興課（ぐじょう）",
        parent: "岐阜県",
    },
    {
        value: "可茂農林事務所農業普及課（かも）",
        parent: "岐阜県",
    },
    {
        value: "東濃農林事務所農業普及課（とうのう）",
        parent: "岐阜県",
    },
    {
        value: "恵那農林事務所農業普及課（えな）",
        parent: "岐阜県",
    },
    {
        value: "下呂農林事務所農業普及課（げろ）",
        parent: "岐阜県",
    },
    {
        value: "飛騨農林事務所農業普及課（ひだ）",
        parent: "岐阜県",
    },

    {
        value: "尾張農林水産事務所農業改良普及課（尾張農業普及指導センター）（おわり）",
        parent: "愛知県",
    },
    {
        value: "海部農林水産事務所農業改良普及課（海部農業普及指導センター）（あま）",
        parent: "愛知県",
    },
    {
        value: "知多農林水産事務所農業改良普及課（知多農業普及指導センター）（ちた）",
        parent: "愛知県",
    },
    {
        value: "西三河農林水産事務所農業改良普及課（西三河農業普及指導センター）（にしみかわ）",
        parent: "愛知県",
    },
    {
        value: "豊田加茂農林水産事務所農業改良普及課（豊田加茂農業普及指導センター）（とよたかも）",
        parent: "愛知県",
    },
    {
        value: "新城設楽農林水産事務所農業改良普及課（新城設楽農業普及指導センター）（しんしろしたら）",
        parent: "愛知県",
    },
    {
        value: "東三河農林水産事務所農業改良普及課（東三河農業普及指導センター）（ひがしみかわ）",
        parent: "愛知県",
    },
    {
        value: "東三河農林水産事務所田原農業改良普及課（田原農業普及指導センター）（たはら）",
        parent: "愛知県",
    },

    {
        value: "中央農業改良普及センター（ちゅうおう）",
        parent: "三重県",
    },
    {
        value: "桑名地域農業改良普及センター（くわな）",
        parent: "三重県",
    },
    {
        value: "四日市鈴鹿地域農業改良普及センター（よっかいちすずか）",
        parent: "三重県",
    },
    {
        value: "津地域農業改良普及センター（つ）",
        parent: "三重県",
    },
    {
        value: "松阪地域農業改良普及センター（まつさか）",
        parent: "三重県",
    },
    {
        value: "伊勢志摩地域農業改良普及センター（いせしま）",
        parent: "三重県",
    },
    {
        value: "伊賀地域農業改良普及センター（いが）",
        parent: "三重県",
    },
    {
        value: "紀州地域農業改良普及センター（きしゅう）",
        parent: "三重県",
    },

    {
        value: "大津・南部農業農村振興事務所農産普及課（おおつ・なんぶ）",
        parent: "滋賀県",
    },
    {
        value: "甲賀農業農村振興事務所農産普及課（こうか）",
        parent: "滋賀県",
    },
    {
        value: "東近江農業農村振興事務所農産普及課（ひがしおうみ）",
        parent: "滋賀県",
    },
    {
        value: "湖東農業農村振興事務所農産普及課（ことう）",
        parent: "滋賀県",
    },
    {
        value: "湖北農業農村振興事務所農産普及課（こほく）",
        parent: "滋賀県",
    },
    {
        value: "高島農業農村振興事務所農産普及課（たかしま）",
        parent: "滋賀県",
    },
    {
        value: "農業技術振興センター農業革新支援部",
        parent: "滋賀県",
    },

    {
        value: "京都乙訓農業改良普及センター（きょうとおとくに）",
        parent: "京都府",
    },
    {
        value: "山城北農業改良普及センター（やましろきた）",
        parent: "京都府",
    },
    {
        value: "山城南農業改良普及センター（やましろみなみ）",
        parent: "京都府",
    },
    {
        value: "南丹農業改良普及センター（なんたん）",
        parent: "京都府",
    },
    {
        value: "中丹東農業改良普及センター（ちゅうたんひがし）",
        parent: "京都府",
    },
    {
        value: "中丹西農業改良普及センター（ちゅうたんにし）",
        parent: "京都府",
    },
    {
        value: "丹後農業改良普及センター（たんご）",
        parent: "京都府",
    },

    {
        value: "北部農と緑の総合事務所　農の普及課（ほくぶ）",
        parent: "大阪府",
    },
    {
        value: "中部農と緑の総合事務所　農の普及課（ちゅうぶ）",
        parent: "大阪府",
    },
    {
        value: "南河内農と緑の総合事務所　農の普及課（みなみかわち）",
        parent: "大阪府",
    },
    {
        value: "泉州農と緑の総合事務所　農の普及課（せんしゅう）",
        parent: "大阪府",
    },

    {
        value: "神戸農業改良普及センター（こうべ）",
        parent: "兵庫県",
    },
    {
        value: "阪神農業改良普及センター（はんしん）",
        parent: "兵庫県",
    },
    {
        value: "加古川農業改良普及センター（かこがわ）",
        parent: "兵庫県",
    },
    {
        value: "加西農業改良普及センター（かさい）",
        parent: "兵庫県",
    },
    {
        value: "姫路農業改良普及センター（ひめじ）",
        parent: "兵庫県",
    },
    {
        value: "光都農業改良普及センター（こうと）",
        parent: "兵庫県",
    },
    {
        value: "龍野農業改良普及センター（たつの）",
        parent: "兵庫県",
    },
    {
        value: "豊岡農業改良普及センター（とよおか）",
        parent: "兵庫県",
    },
    {
        value: "新温泉農業改良普及センター（しんおんせん）",
        parent: "兵庫県",
    },
    {
        value: "朝来農業改良普及センター（あさご）",
        parent: "兵庫県",
    },
    {
        value: "丹波農業改良普及センター（たんば）",
        parent: "兵庫県",
    },
    {
        value: "南淡路農業改良普及センター（みなみあわじ）",
        parent: "兵庫県",
    },
    {
        value: "北淡路農業改良普及センター（きたあわじ）",
        parent: "兵庫県",
    },

    {
        value: "北部農林振興事務所農林普及課（ほくぶ）",
        parent: "奈良県",
    },
    {
        value: "中部農林振興事務所農林普及課（ちゅうぶ）",
        parent: "奈良県",
    },
    {
        value: "東部農林振興事務所農業普及課（とうぶ）",
        parent: "奈良県",
    },
    {
        value: "南部農林振興事務所農業普及課（なんぶ）",
        parent: "奈良県",
    },

    {
        value: "海草振興局地域振興部農業水産振興課（かいそう）",
        parent: "和歌山県",
    },
    {
        value: "那賀振興局地域振興部農業水産振興課（なが）",
        parent: "和歌山県",
    },
    {
        value: "伊都振興局地域振興部農業水産振興課（いと）",
        parent: "和歌山県",
    },
    {
        value: "有田振興局地域振興部農業水産振興課（ありだ）",
        parent: "和歌山県",
    },
    {
        value: "日高振興局地域振興部農業水産振興課（ひだか）",
        parent: "和歌山県",
    },
    {
        value: "西牟婁振興局地域振興部農業水産振興課（にしむろ）",
        parent: "和歌山県",
    },
    {
        value: "東牟婁振興局地域振興部農業水産振興課（ひがしむろ）",
        parent: "和歌山県",
    },

    {
        value: "東部農林事務所鳥取農業改良普及所（とっとり）",
        parent: "鳥取県",
    },
    {
        value: "東部農林事務所八頭事務所八頭農業改良普及所（やず）",
        parent: "鳥取県",
    },
    {
        value: "中部総合事務所農林局倉吉農業改良普及所（くらよし）",
        parent: "鳥取県",
    },
    {
        value: "中部総合事務所農林局東伯農業改良普及所（とうはく）",
        parent: "鳥取県",
    },
    {
        value: "西部総合事務所農林局西部農業改良普及所（せいぶ）",
        parent: "鳥取県",
    },
    {
        value: "西部総合事務所農林局西部農業改良普及所大山普及支所（せいぶ・だいせん）",
        parent: "鳥取県",
    },
    {
        value: "西部総合事務所日野振興センター日野振興局日野農業改良普及所（ひの）",
        parent: "鳥取県",
    },

    {
        value: "東部農林水産振興センター農業振興部（とうぶ・まつえ）",
        parent: "島根県",
    },
    {
        value: "東部農林水産振興センター雲南事務所農業部（とうぶ・うんなん）",
        parent: "島根県",
    },
    {
        value: "東部農林水産振興センター出雲事務所農業部（とうぶ・いずも）",
        parent: "島根県",
    },
    {
        value: "西部農林水産振興センター農業振興部（せいぶ・はまだ）",
        parent: "島根県",
    },
    {
        value: "西部農林水産振興センター県央事務所邑智農業部（せいぶ・けんおう）",
        parent: "島根県",
    },
    {
        value: "西部農林水産振興センター県央事務所大田農業部（せいぶ・けんおう・おおだ）",
        parent: "島根県",
    },
    {
        value: "西部農林水産振興センター益田事務所益田農業部（せいぶ・ますだ）",
        parent: "島根県",
    },
    {
        value: "隠岐農林水産局農政・普及部（おき）",
        parent: "島根県",
    },
    {
        value: "農業技術センター 技術普及部",
        parent: "島根県",
    },

    {
        value: "備前県民局農林水産事業部備前広域農業普及指導センター（びぜん）",
        parent: "岡山県",
    },
    {
        value: "備前県民局農林水産事業部東備農業普及指導センター（とうび）",
        parent: "岡山県",
    },
    {
        value: "備中県民局農林水産事業部備南広域農業普及指導センター（びなん）",
        parent: "岡山県",
    },
    {
        value: "備中県民局農林水産事業部井笠農業普及指導センター（いかさ）",
        parent: "岡山県",
    },
    {
        value: "備中県民局農林水産事業部備北広域農業普及指導センター（びほく）",
        parent: "岡山県",
    },
    {
        value: "備中県民局農林水産事業部新見農業普及指導センター（にいみ）",
        parent: "岡山県",
    },
    {
        value: "美作県民局農林水産事業部美作広域農業普及指導センター（みまさか）",
        parent: "岡山県",
    },
    {
        value: "美作県民局農林水産事業部真庭農業普及指導センター（まにわ）",
        parent: "岡山県",
    },
    {
        value: "美作県民局農林水産事業部勝英農業普及指導センター（しょうえい）",
        parent: "岡山県",
    },

    {
        value: "西部農業技術指導所（せいぶ）",
        parent: "広島県",
    },
    {
        value: "東部農業技術指導所（とうぶ）",
        parent: "広島県",
    },
    {
        value: "北部農業技術指導所（ほくぶ）",
        parent: "広島県",
    },

    {
        value: "岩国農林水産事務所（いわくに）",
        parent: "山口県",
    },
    {
        value: "柳井農林水産事務所（やない）",
        parent: "山口県",
    },
    {
        value: "周南農林水産事務所（しゅうなん）",
        parent: "山口県",
    },
    {
        value: "山口農林水産事務所（やまぐち）",
        parent: "山口県",
    },
    {
        value: "美祢農林水産事務所（みね）",
        parent: "山口県",
    },
    {
        value: "下関農林事務所（しものせき）",
        parent: "山口県",
    },
    {
        value: "長門農林水産事務所（ながと）",
        parent: "山口県",
    },
    {
        value: "萩農林水産事務所（はぎ）",
        parent: "山口県",
    },

    {
        value: "農林水産総合技術支援センター　高度技術支援課（高度技術支援センター）（こうどぎじゅつしえん）",
        parent: "徳島県",
    },
    {
        value: "徳島農業支援センター（とくしま）",
        parent: "徳島県",
    },
    {
        value: "鳴門藍住農業支援センター（なるとあいずみ）",
        parent: "徳島県",
    },
    {
        value: "阿南農業支援センター（あなん）",
        parent: "徳島県",
    },
    {
        value: "美波農業支援センター（みなみ）",
        parent: "徳島県",
    },
    {
        value: "吉野川農業支援センター（よしのがわ）",
        parent: "徳島県",
    },
    {
        value: "美馬農業支援センター（みま）",
        parent: "徳島県",
    },
    {
        value: "三好農業支援センター（みよし）",
        parent: "徳島県",
    },

    {
        value: "東讃農業改良普及センター（とうさん）",
        parent: "香川県",
    },
    {
        value: "小豆農業改良普及センター（しょうず）",
        parent: "香川県",
    },
    {
        value: "中讃農業改良普及センター（ちゅうさん）",
        parent: "香川県",
    },
    {
        value: "西讃農業改良普及センター（せいさん）",
        parent: "香川県",
    },

    {
        value: "東予地方局農林水産振興部農業振興課（とうよ）",
        parent: "愛媛県",
    },
    {
        value: "東予地方局農林水産振興部今治支局地域農業育成室・産地戦略推進室（いまばり）",
        parent: "愛媛県",
    },
    {
        value: "中予地方局農林水産振興部農業振興課（ちゅうよ）",
        parent: "愛媛県",
    },
    {
        value: "南予地方局農林水産振興部農業振興課（なんよ）",
        parent: "愛媛県",
    },
    {
        value: "南予地方局農林水産振興部八幡浜支局地域農業育成室・産地戦略推進室（やわたはま）",
        parent: "愛媛県",
    },

    {
        value: "安芸農業振興センター農業改良普及課（あき）",
        parent: "高知県",
    },
    {
        value: "中央東農業振興センター農業改良普及課（ちゅうおうひがし）",
        parent: "高知県",
    },
    {
        value: "中央東農業振興センター嶺北農業改良普及所（ちゅうおうひがし・れいほく）",
        parent: "高知県",
    },
    {
        value: "中央西農業振興センター農業改良普及課（ちゅうおうにし）",
        parent: "高知県",
    },
    {
        value: "中央西農業振興センター高知農業改良普及所（ちゅうおうにし・こうち）",
        parent: "高知県",
    },
    {
        value: "中央西農業振興センター高吾農業改良普及所（ちゅうおうにし・こうご）",
        parent: "高知県",
    },
    {
        value: "須崎農業振興センター農業改良普及課（すさき）",
        parent: "高知県",
    },
    {
        value: "須崎農業振興センター高南農業改良普及所（すさき・こうなん）",
        parent: "高知県",
    },
    {
        value: "幡多農業振興センター農業改良普及課（はた）",
        parent: "高知県",
    },

    {
        value: "福岡普及指導センター（ふくおか）",
        parent: "福岡県",
    },
    {
        value: "北筑前普及指導センター（きたちくぜん）",
        parent: "福岡県",
    },
    {
        value: "朝倉普及指導センター（あさくら）",
        parent: "福岡県",
    },
    {
        value: "久留米普及指導センター（くるめ）",
        parent: "福岡県",
    },
    {
        value: "北九州普及指導センター（きたきゅうしゅう）",
        parent: "福岡県",
    },
    {
        value: "飯塚普及指導センター（いいづか）",
        parent: "福岡県",
    },
    {
        value: "田川普及指導センター（たがわ）",
        parent: "福岡県",
    },
    {
        value: "南筑後普及指導センター（みなみちくご）",
        parent: "福岡県",
    },
    {
        value: "八女普及指導センター（やめ）",
        parent: "福岡県",
    },
    {
        value: "京築普及指導センター（けいちく）",
        parent: "福岡県",
    },

    {
        value: "農林水産部　中部農林事務所佐城農業改良普及センター（さじょう）",
        parent: "佐賀県",
    },
    {
        value: "農林水産部　東部農林事務所三神農業改良普及センター（さんしん）",
        parent: "佐賀県",
    },
    {
        value: "農林水産部　唐津農林事務所東松浦農業改良普及センター（ひがしまつうら）",
        parent: "佐賀県",
    },
    {
        value: "農林水産部　伊万里農林事務所西松浦農業改良普及センター（にしまつうら）",
        parent: "佐賀県",
    },
    {
        value: "農林水産部　杵藤農林事務所杵島農業改良普及センター（きしま）",
        parent: "佐賀県",
    },
    {
        value: "農林水産部　杵藤農林事務所藤津農業改良普及センター（ふじつ）",
        parent: "佐賀県",
    },

    {
        value: "県央振興局農林部（けんおう）",
        parent: "長崎県",
    },
    {
        value: "島原振興局農林水産部（しまばら）",
        parent: "長崎県",
    },
    {
        value: "県北振興局農林部（けんほく）",
        parent: "長崎県",
    },
    {
        value: "五島振興局農林水産部（ごとう）",
        parent: "長崎県",
    },
    {
        value: "壱岐振興局農林水産部（いき）",
        parent: "長崎県",
    },
    {
        value: "対馬振興局農林水産部（つしま）",
        parent: "長崎県",
    },

    {
        value: "県央広域本部（熊本農政事務所）（けんおう・くまもと）",
        parent: "熊本県",
    },
    {
        value: "県央広域本部　宇城地域振興局（うき）",
        parent: "熊本県",
    },
    {
        value: "県央広域本部　上益城地域振興局（かみましき）",
        parent: "熊本県",
    },
    {
        value: "県北広域本部（菊池地域振興局）（けんほく・きくち）",
        parent: "熊本県",
    },
    {
        value: "県北広域本部　玉名地域振興局（たまな）",
        parent: "熊本県",
    },
    {
        value: "県北広域本部　鹿本地域振興局（かもと）",
        parent: "熊本県",
    },
    {
        value: "県北広域本部　阿蘇地域振興局（あそ）",
        parent: "熊本県",
    },
    {
        value: "県南広域本部（八代地域振興局）（けんなん・やつしろ）",
        parent: "熊本県",
    },
    {
        value: "県南広域本部　芦北地域振興局（あしきた）",
        parent: "熊本県",
    },
    {
        value: "県南広域本部　球磨地域振興局（くま）",
        parent: "熊本県",
    },
    {
        value: "天草広域本部（天草地域振興局）（あまくさ）",
        parent: "熊本県",
    },

    {
        value: "東部振興局（農産漁村振興部・生産流通部）（とうぶ）",
        parent: "大分県",
    },
    {
        value: "中部振興局（農産漁村振興部・生産流通部）（ちゅうぶ）",
        parent: "大分県",
    },
    {
        value: "南部振興局（農産漁村振興部・生産流通部）（なんぶ）",
        parent: "大分県",
    },
    {
        value: "豊肥振興局（農産村振興部・生産流通部）（ほうひ）",
        parent: "大分県",
    },
    {
        value: "西部振興局（農産村振興部・生産流通部）（せいぶ）",
        parent: "大分県",
    },
    {
        value: "北部振興局（農産漁村振興部・生産流通部）（ほくぶ）",
        parent: "大分県",
    },

    {
        value: "中部農林振興局（中部農業改良普及センター）（ちゅうぶ）",
        parent: "宮崎県",
    },
    {
        value: "南那珂農林振興局（南那珂農業改良普及センター）（みなみなか）",
        parent: "宮崎県",
    },
    {
        value: "北諸県農林振興局（北諸県農業改良普及センター）（きたもろかた）",
        parent: "宮崎県",
    },
    {
        value: "西諸県農林振興局（西諸県農業改良普及センター）（にしもろかた）",
        parent: "宮崎県",
    },
    {
        value: "児湯農林振興局（児湯農業改良普及センター）（こゆ）",
        parent: "宮崎県",
    },
    {
        value: "東臼杵農林振興局　南部普及担当（東臼杵南部農業改良普及センター）（ひがしうすきなんぶ）",
        parent: "宮崎県",
    },
    {
        value: "東臼杵農林振興局　北部普及担当（東臼杵北部農業改良普及センター）（ひがしうすきほくぶ）",
        parent: "宮崎県",
    },
    {
        value: "西臼杵支庁（西臼杵農業改良普及センター）（にしうすき）",
        parent: "宮崎県",
    },

    {
        value: "鹿児島地域振興局　農林水産部　農政普及課（かごしま）",
        parent: "鹿児島県",
    },
    {
        value: "南薩地域振興局　農林水産部　農政普及課（なんさつ）",
        parent: "鹿児島県",
    },
    {
        value: "北薩地域振興局　農林水産部　農政普及課（ほくさつ）",
        parent: "鹿児島県",
    },
    {
        value: "姶良・伊佐地域振興局　農林水産部　農政普及課（あいら・いさ）",
        parent: "鹿児島県",
    },
    {
        value: "大隅地域振興局　農林水産部　農政普及課（おおすみ）",
        parent: "鹿児島県",
    },
    {
        value: "大隅地域振興局　農林水産部　曽於畑地かんがい農業推進センター　農業普及課（そお）",
        parent: "鹿児島県",
    },
    {
        value: "熊毛支庁　農林水産部　農政普及課（くまげ）",
        parent: "鹿児島県",
    },
    {
        value: "熊毛支庁　屋久島事務所　農林普及課（やくしま）",
        parent: "鹿児島県",
    },
    {
        value: "大島支庁　農林水産部　農政普及課（おおしま）",
        parent: "鹿児島県",
    },
    {
        value: "大島支庁　徳之島事務所　農業普及課（とくのしま）",
        parent: "鹿児島県",
    },
    {
        value: "大島支庁　沖永良部事務所　農業普及課（おきのえらぶ）",
        parent: "鹿児島県",
    },

    {
        value: "北部農林水産振興センター農業改良普及課（ほくぶ）",
        parent: "沖縄県",
    },
    {
        value: "中部農業改良普及センター（ちゅうぶ）",
        parent: "沖縄県",
    },
    {
        value: "南部農業改良普及センター（なんぶ）",
        parent: "沖縄県",
    },
    {
        value: "宮古農林水産振興センター農業改良普及課（みやこ）",
        parent: "沖縄県",
    },
    {
        value: "八重山農林水産振興センター農業改良普及課（やえやま）",
        parent: "沖縄県",
    },
];

export const JaOption = [
    {
        value: "JAいしかり",
        parent: "北海道",
        area: "道央",
        promotionBureau: "石狩振興局",
    },
    {
        value: "JAさっぽろ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "石狩振興局",
    },
    {
        value: "JA北いしかり",
        parent: "北海道",
        area: "道央",
        promotionBureau: "石狩振興局",
    },
    {
        value: "JA道央",
        parent: "北海道",
        area: "道央",
        promotionBureau: "石狩振興局",
    },
    {
        value: "JA新しのつ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "石狩振興局",
    },

    {
        value: "JAいわみざわ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAびばい",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAみねのぶ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JA月形町",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAなんぽろ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAそらち南",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAながぬま",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAたきかわ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JA夕張市",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAピンネ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JA新すながわ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JA北いぶき",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },
    {
        value: "JAきたそらち",
        parent: "北海道",
        area: "道央",
        promotionBureau: "空知総合振興局",
    },

    {
        value: "JAようてい",
        parent: "北海道",
        area: "道央",
        promotionBureau: "後志総合振興局",
    },
    {
        value: "JA新おたる",
        parent: "北海道",
        area: "道央",
        promotionBureau: "後志総合振興局",
    },
    {
        value: "JAきょうわ",
        parent: "北海道",
        area: "道央",
        promotionBureau: "後志総合振興局",
    },
    {
        value: "JAよいち",
        parent: "北海道",
        area: "道央",
        promotionBureau: "後志総合振興局",
    },

    {
        value: "JA新はこだて",
        parent: "北海道",
        area: "道南",
        promotionBureau: "渡島総合振興局・檜山振興局",
    },
    {
        value: "JAきたひやま",
        parent: "北海道",
        area: "道南",
        promotionBureau: "渡島総合振興局・檜山振興局",
    },
    {
        value: "JA今金町",
        parent: "北海道",
        area: "道南",
        promotionBureau: "渡島総合振興局・檜山振興局",
    },
    {
        value: "JA函館市亀田",
        parent: "北海道",
        area: "道南",
        promotionBureau: "渡島総合振興局・檜山振興局",
    },

    {
        value: "JAとうや湖",
        parent: "北海道",
        area: "道南",
        promotionBureau: "胆振総合振興局",
    },
    {
        value: "JA伊達市",
        parent: "北海道",
        area: "道南",
        promotionBureau: "胆振総合振興局",
    },
    {
        value: "JAとまこまい広域",
        parent: "北海道",
        area: "道南",
        promotionBureau: "胆振総合振興局",
    },
    {
        value: "JAむかわ",
        parent: "北海道",
        area: "道南",
        promotionBureau: "胆振総合振興局",
    },

    {
        value: "JAびらとり",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },
    {
        value: "JA門別",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },
    {
        value: "JAにいかっぷ",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },
    {
        value: "JAしずない",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },
    {
        value: "JAみついし",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },
    {
        value: "JAひだか東",
        parent: "北海道",
        area: "道南",
        promotionBureau: "日高振興局",
    },

    {
        value: "JAあさひかわ",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA上川中央",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JAたいせつ",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA東神楽",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA東旭川",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA当麻",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JAぴっぷ町",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JAひがしかわ",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JAびえい",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA北ひびき",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA道北なよろ",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JA北はるか",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },
    {
        value: "JAふらの",
        parent: "北海道",
        area: "道北",
        promotionBureau: "上川総合振興局",
    },

    {
        value: "JAるもい",
        parent: "北海道",
        area: "道北",
        promotionBureau: "留萌振興局",
    },

    {
        value: "JA稚内",
        parent: "北海道",
        area: "道北",
        promotionBureau: "宗谷総合振興局",
    },
    {
        value: "JAひがし宗谷",
        parent: "北海道",
        area: "道北",
        promotionBureau: "宗谷総合振興局",
    },
    {
        value: "JA北宗谷",
        parent: "北海道",
        area: "道北",
        promotionBureau: "宗谷総合振興局",
    },
    {
        value: "JA宗谷南",
        parent: "北海道",
        area: "道北",
        promotionBureau: "宗谷総合振興局",
    },
    {
        value: "JA幌延町",
        parent: "北海道",
        area: "道北",
        promotionBureau: "宗谷総合振興局",
    },

    {
        value: "JA北オホーツク",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAオホーツクはまなす",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAサロマ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAゆうべつ町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAえんゆう",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAつべつ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAびほろ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAめまんべつ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAところ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAオホーツク網走",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAこしみず",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAしれとこ斜里",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JA清里町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },
    {
        value: "JAきたみらい",
        parent: "北海道",
        area: "道東",
        promotionBureau: "オホーツク総合振興局",
    },

    {
        value: "JA帯広かわにし",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA帯広大正",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA中札内村",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAさらべつ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA忠類",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA大樹町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAひろお",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAめむろ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA十勝清水町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA新得町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA鹿追町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA木野",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAおとふけ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA士幌町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA上士幌町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAさつない",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA幕別町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA十勝池田町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA豊頃町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAうらほろ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA本別町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JAあしょろ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },
    {
        value: "JA陸別町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "十勝総合振興局",
    },

    {
        value: "JA釧路太田",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },
    {
        value: "JA浜中町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },
    {
        value: "JAしべちゃ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },
    {
        value: "JA摩周湖",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },
    {
        value: "JA阿寒",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },
    {
        value: "JAくしろ丹頂",
        parent: "北海道",
        area: "道東",
        promotionBureau: "釧路総合振興局",
    },

    {
        value: "JA標津",
        parent: "北海道",
        area: "道東",
        promotionBureau: "根室振興局",
    },
    {
        value: "JA中標津町",
        parent: "北海道",
        area: "道東",
        promotionBureau: "根室振興局",
    },
    {
        value: "JAけねべつ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "根室振興局",
    },
    {
        value: "JA中春別（なかしゅんべつ）",
        parent: "北海道",
        area: "道東",
        promotionBureau: "根室振興局",
    },
    {
        value: "JA道東あさひ",
        parent: "北海道",
        area: "道東",
        promotionBureau: "根室振興局",
    },

    { value: "JAおいらせ", parent: "青森県" },
    { value: "JAごしょつがる", parent: "青森県" },
    { value: "JAつがるにしきた", parent: "青森県" },
    { value: "JAつがる弘前", parent: "青森県" },
    { value: "JAゆうき青森", parent: "青森県" },
    { value: "JA八戸", parent: "青森県" },
    { value: "JA十和田おいらせ", parent: "青森県" },
    { value: "JA津軽みらい", parent: "青森県" },
    { value: "JA相馬村", parent: "青森県" },
    { value: "JA青森", parent: "青森県" },

    { value: "JAあきた北", parent: "秋田県" },
    { value: "JAあきた湖東", parent: "秋田県" },
    { value: "JAあきた白神", parent: "秋田県" },
    { value: "JAうご", parent: "秋田県" },
    { value: "JAかづの", parent: "秋田県" },
    { value: "JAこまち", parent: "秋田県" },
    { value: "JA大潟村", parent: "秋田県" },
    { value: "JA秋田おばこ", parent: "秋田県" },
    { value: "JA秋田しんせい", parent: "秋田県" },
    { value: "JA秋田たかのす", parent: "秋田県" },
    { value: "JA秋田なまはげ", parent: "秋田県" },
    { value: "JA秋田ふるさと", parent: "秋田県" },
    { value: "JA秋田やまもと", parent: "秋田県" },

    { value: "JAいわて中央", parent: "岩手県" },
    { value: "JAいわて平泉", parent: "岩手県" },
    { value: "JAいわて花巻", parent: "岩手県" },
    { value: "JAおおふなと", parent: "岩手県" },
    { value: "JA岩手ふるさと", parent: "岩手県" },
    { value: "JA新いわて", parent: "岩手県" },
    { value: "JA江刺", parent: "岩手県" },

    { value: "JAあまるめ", parent: "山形県" },
    { value: "JAおいしいもがみ", parent: "山形県" },
    { value: "JAさがえ西村山", parent: "山形県" },
    { value: "JAさくらんぼひがしね", parent: "山形県" },
    { value: "JAそでうら", parent: "山形県" },
    { value: "JAてんどう", parent: "山形県" },
    { value: "JAみちのく村山", parent: "山形県" },
    { value: "JAやまがた", parent: "山形県" },
    { value: "JA山形おきたま", parent: "山形県" },
    { value: "JA山形市", parent: "山形県" },
    { value: "JA庄内たがわ", parent: "山形県" },
    { value: "JA庄内みどり", parent: "山形県" },
    { value: "JA新庄市", parent: "山形県" },
    { value: "JA金山", parent: "山形県" },
    { value: "JA鶴岡", parent: "山形県" },

    { value: "JAいしのまき", parent: "宮城県" },
    { value: "JAみやぎ亘理", parent: "宮城県" },
    { value: "JAみやぎ仙南", parent: "宮城県" },
    { value: "JAみやぎ登米", parent: "宮城県" },
    { value: "JA仙台", parent: "宮城県" },
    { value: "JA加美よつば", parent: "宮城県" },
    { value: "JA古川", parent: "宮城県" },
    { value: "JA名取岩沼", parent: "宮城県" },
    { value: "JA岩沼市", parent: "宮城県" },
    { value: "JA新みやぎ", parent: "宮城県" },

    { value: "JAふくしま未来", parent: "福島県" },
    { value: "JA会津よつば", parent: "福島県" },
    { value: "JA夢みなみ", parent: "福島県" },
    { value: "JA東西しらかわ", parent: "福島県" },
    { value: "JA福島さくら", parent: "福島県" },

    { value: "JAえちご上越", parent: "新潟県" },
    { value: "JAかみはやし", parent: "新潟県" },
    { value: "JAささかみ", parent: "新潟県" },
    { value: "JAにいがた南蒲", parent: "新潟県" },
    { value: "JAにいがた岩船", parent: "新潟県" },
    { value: "JAひすい", parent: "新潟県" },
    { value: "JAみなみ魚沼", parent: "新潟県" },
    { value: "JA佐渡", parent: "新潟県" },
    { value: "JA北蒲みなみ", parent: "新潟県" },
    { value: "JA北越後", parent: "新潟県" },
    { value: "JA北魚沼", parent: "新潟県" },
    { value: "JA十日町", parent: "新潟県" },
    { value: "JA新津さつき", parent: "新潟県" },
    { value: "JA新潟みらい", parent: "新潟県" },
    { value: "JA新潟市", parent: "新潟県" },
    { value: "JA柏崎", parent: "新潟県" },
    { value: "JA津南町", parent: "新潟県" },
    { value: "JA羽茂", parent: "新潟県" },
    { value: "JA胎内市", parent: "新潟県" },
    { value: "JA越後おぢや", parent: "新潟県" },
    { value: "JA越後さんとう", parent: "新潟県" },
    { value: "JA越後ながおか", parent: "新潟県" },
    { value: "JA越後中央", parent: "新潟県" },

    { value: "JAみな穂", parent: "富山県" },
    { value: "JAくろべ", parent: "富山県" },
    { value: "JAうおづ", parent: "富山県" },
    { value: "JAいなば", parent: "富山県" },
    { value: "JAアルプス", parent: "富山県" },
    { value: "JAあおば", parent: "富山県" },
    { value: "JA福光", parent: "富山県" },
    { value: "JAなんと", parent: "富山県" },
    { value: "JAとなみ野", parent: "富山県" },
    { value: "JA氷見市", parent: "富山県" },
    { value: "JA山田村", parent: "富山県" },
    { value: "JAなのはな", parent: "富山県" },
    { value: "JA富山市", parent: "富山県" },
    { value: "JAいみず野", parent: "富山県" },
    { value: "JA高岡", parent: "富山県" },

    { value: "JAおおぞら", parent: "石川県" },
    { value: "JAすずし", parent: "石川県" },
    { value: "JAののいち", parent: "石川県" },
    { value: "JAはくい", parent: "石川県" },
    { value: "JA内浦町", parent: "石川県" },
    { value: "JA加賀", parent: "石川県" },
    { value: "JA小松市", parent: "石川県" },
    { value: "JA志賀", parent: "石川県" },
    { value: "JA松任", parent: "石川県" },
    { value: "JA根上", parent: "石川県" },
    { value: "JA白山", parent: "石川県" },
    { value: "JA石川かほく", parent: "石川県" },
    { value: "JA能登わかば", parent: "石川県" },
    { value: "JA能美", parent: "石川県" },
    { value: "JA金沢中央", parent: "石川県" },
    { value: "JA金沢市", parent: "石川県" },

    { value: "JA福井県", parent: "福井県" },
    { value: "JA越前たけふ", parent: "福井県" },

    { value: "JAふえふき", parent: "山梨県" },
    { value: "JAクレイン", parent: "山梨県" },
    { value: "JAフルーツ山梨", parent: "山梨県" },
    { value: "JA南アルプス市", parent: "山梨県" },
    { value: "JA山梨みらい", parent: "山梨県" },
    { value: "JA梨北", parent: "山梨県" },
    { value: "JA鳴沢村", parent: "山梨県" },
    { value: "JA北富士", parent: "山梨県" },

    { value: "佐久浅間", parent: "長野県" },
    { value: "JA信州上田", parent: "長野県" },
    { value: "JAグリーン長野", parent: "長野県" },
    { value: "JA中野", parent: "長野県" },
    { value: "JAあづみ", parent: "長野県" },
    { value: "JAながの", parent: "長野県" },
    { value: "JAみなみ信州", parent: "長野県" },
    { value: "JAグリーン長野", parent: "長野県" },
    { value: "JA上伊那", parent: "長野県" },
    { value: "JA中野市", parent: "長野県" },
    { value: "JA佐久浅間", parent: "長野県" },
    { value: "JA信州うえだ", parent: "長野県" },
    { value: "JA木曽", parent: "長野県" },
    { value: "JA信州諏訪", parent: "長野県" },
    { value: "JA大北", parent: "長野県" },
    { value: "JA松本ハイランド", parent: "長野県" },
    { value: "JA洗馬", parent: "長野県" },
    { value: "JA長野八ヶ岳", parent: "長野県" },

    { value: "JAうつのみや", parent: "栃木県" },
    { value: "JAおやま", parent: "栃木県" },
    { value: "JAかみつが", parent: "栃木県" },
    { value: "JAしおのや", parent: "栃木県" },
    { value: "JAしもつけ", parent: "栃木県" },
    { value: "JAなすの", parent: "栃木県" },
    { value: "JAなす南", parent: "栃木県" },
    { value: "JAはが野", parent: "栃木県" },
    { value: "JA佐野", parent: "栃木県" },
    { value: "JA足利", parent: "栃木県" },

    { value: "JAつくば市", parent: "茨城県" },
    { value: "JAつくば市谷田部", parent: "茨城県" },
    { value: "JAなめがたしおさい", parent: "茨城県" },
    { value: "JAほこた", parent: "茨城県" },
    { value: "JAやさと", parent: "茨城県" },
    { value: "JA北つくば", parent: "茨城県" },
    { value: "JA岩井", parent: "茨城県" },
    { value: "JA常総ひかり", parent: "茨城県" },
    { value: "JA常陸", parent: "茨城県" },
    { value: "JA新ひたち野", parent: "茨城県" },
    { value: "JA日立市多賀", parent: "茨城県" },
    { value: "JA水戸", parent: "茨城県" },
    { value: "JA水郷つくば", parent: "茨城県" },
    { value: "JA稲敷", parent: "茨城県" },
    { value: "JA茨城みなみ", parent: "茨城県" },
    { value: "JA茨城むつみ", parent: "茨城県" },
    { value: "JA茨城旭村", parent: "茨城県" },

    { value: "JAあがつま", parent: "群馬県" },
    { value: "JAたかさき", parent: "群馬県" },
    { value: "JAたのふじ", parent: "群馬県" },
    { value: "JAにったみどり", parent: "群馬県" },
    { value: "JAはぐくみ", parent: "群馬県" },
    { value: "JA佐波伊勢崎", parent: "群馬県" },
    { value: "JA利根沼田", parent: "群馬県" },
    { value: "JA前橋市", parent: "群馬県" },
    { value: "JA北群渋川", parent: "群馬県" },
    { value: "JA太田市", parent: "群馬県" },
    { value: "JA嬬恋村", parent: "群馬県" },
    { value: "JA甘楽富岡", parent: "群馬県" },
    { value: "JA赤城たちばな", parent: "群馬県" },
    { value: "JA邑楽館林", parent: "群馬県" },
    { value: "JA碓氷安中", parent: "群馬県" },

    { value: "JAあさか野", parent: "埼玉県" },
    { value: "JAいるま野", parent: "埼玉県" },
    { value: "JAくまがや", parent: "埼玉県" },
    { value: "JAさいかつ", parent: "埼玉県" },
    { value: "JAさいたま", parent: "埼玉県" },
    { value: "JAちちぶ", parent: "埼玉県" },
    { value: "JAふかや", parent: "埼玉県" },
    { value: "JAほくさい", parent: "埼玉県" },
    { value: "JA南彩", parent: "埼玉県" },
    { value: "JA埼玉ひびきの", parent: "埼玉県" },
    { value: "JA埼玉みずほ", parent: "埼玉県" },
    { value: "JA埼玉中央", parent: "埼玉県" },
    { value: "JA埼玉岡部", parent: "埼玉県" },
    { value: "JA花園", parent: "埼玉県" },
    { value: "JA越谷市", parent: "埼玉県" },

    { value: "JAいすみ", parent: "千葉県" },
    { value: "JAいちかわ", parent: "千葉県" },
    { value: "JAかとり", parent: "千葉県" },
    { value: "JAきみつ", parent: "千葉県" },
    { value: "JAちばみどり", parent: "千葉県" },
    { value: "JAちば東葛", parent: "千葉県" },
    { value: "JAとうかつ中央", parent: "千葉県" },
    { value: "JA八千代市", parent: "千葉県" },
    { value: "JA千葉みらい", parent: "千葉県" },
    { value: "JA安房", parent: "千葉県" },
    { value: "JA富里市", parent: "千葉県" },
    { value: "JA山武郡市", parent: "千葉県" },
    { value: "JA市原市", parent: "千葉県" },
    { value: "JA成田市", parent: "千葉県" },
    { value: "JA木更津市", parent: "千葉県" },
    { value: "JA西印旛", parent: "千葉県" },
    { value: "JA長生", parent: "千葉県" },

    { value: "JAあきがわ", parent: "東京都" },
    { value: "JAにしたま", parent: "東京都" },
    { value: "JAマインズ", parent: "東京都" },
    { value: "JA世田谷目黒", parent: "東京都" },
    { value: "JA八王子", parent: "東京都" },
    { value: "JA東京あおば", parent: "東京都" },
    { value: "JA東京みどり", parent: "東京都" },
    { value: "JA東京みなみ", parent: "東京都" },
    { value: "JA東京みらい", parent: "東京都" },
    { value: "JA東京むさし", parent: "東京都" },
    { value: "JA東京スマイル", parent: "東京都" },
    { value: "JA東京中央", parent: "東京都" },
    { value: "JA東京島しょ", parent: "東京都" },
    { value: "JA町田市", parent: "東京都" },
    { value: "JA西東京", parent: "東京都" },

    { value: "JAあつぎ", parent: "神奈川県" },
    { value: "JAかながわ西湘", parent: "神奈川県" },
    { value: "JAさがみ", parent: "神奈川県" },
    { value: "JAはだの", parent: "神奈川県" },
    { value: "JAよこすか葉山", parent: "神奈川県" },
    { value: "JAセレサ川崎", parent: "神奈川県" },
    { value: "JA三浦市", parent: "神奈川県" },
    { value: "JA横浜", parent: "神奈川県" },
    { value: "JA湘南", parent: "神奈川県" },
    { value: "JA相模原市", parent: "神奈川県" },
    { value: "JA県央愛川", parent: "神奈川県" },
    { value: "JA神奈川つくい", parent: "神奈川県" },

    { value: "JAあいら伊豆", parent: "静岡県" },
    { value: "JAしみず", parent: "静岡県" },
    { value: "JAとぴあ浜松", parent: "静岡県" },
    { value: "JAなんすん", parent: "静岡県" },
    { value: "JAみっかび", parent: "静岡県" },
    { value: "JAハイナン", parent: "静岡県" },
    { value: "JA三島函南", parent: "静岡県" },
    { value: "JA伊豆の国", parent: "静岡県" },
    { value: "JA伊豆太陽", parent: "静岡県" },
    { value: "JA大井川", parent: "静岡県" },
    { value: "JA富士宮", parent: "静岡県" },
    { value: "JA富士市", parent: "静岡県" },
    { value: "JA御殿場", parent: "静岡県" },
    { value: "JA掛川市", parent: "静岡県" },
    { value: "JA遠州中央", parent: "静岡県" },
    { value: "JA遠州夢咲", parent: "静岡県" },
    { value: "JA静岡市", parent: "静岡県" },

    { value: "JAあいち三河", parent: "愛知県" },
    { value: "JAあいち中央", parent: "愛知県" },
    { value: "JAあいち尾東", parent: "愛知県" },
    { value: "JAあいち海部", parent: "愛知県" },
    { value: "JAあいち知多", parent: "愛知県" },
    { value: "JAあいち豊田", parent: "愛知県" },
    { value: "JAなごや", parent: "愛知県" },
    { value: "JAひまわり", parent: "愛知県" },
    { value: "JA天白信用", parent: "愛知県" },
    { value: "JA尾張中央", parent: "愛知県" },
    { value: "JA愛知みなみ", parent: "愛知県" },
    { value: "JA愛知北", parent: "愛知県" },
    { value: "JA愛知東", parent: "愛知県" },
    { value: "JA愛知西", parent: "愛知県" },
    { value: "JA海部東", parent: "愛知県" },
    { value: "JA緑信用", parent: "愛知県" },
    { value: "JA蒲郡市", parent: "愛知県" },
    { value: "JA西三河", parent: "愛知県" },
    { value: "JA西春日井", parent: "愛知県" },
    { value: "JA豊橋", parent: "愛知県" },

    { value: "JAいび川", parent: "岐阜県" },
    { value: "JAぎふ", parent: "岐阜県" },
    { value: "JAとうと", parent: "岐阜県" },
    { value: "JAにしみの", parent: "岐阜県" },
    { value: "JAひがしみの", parent: "岐阜県" },
    { value: "JAひだ", parent: "岐阜県" },
    { value: "JAめぐみの", parent: "岐阜県" },

    { value: "JAいがふるさと", parent: "三重県" },
    { value: "JAみえきた", parent: "三重県" },
    { value: "JAみえなか", parent: "三重県" },
    { value: "JA伊勢", parent: "三重県" },
    { value: "JA多気郡", parent: "三重県" },
    { value: "JA津安芸", parent: "三重県" },
    { value: "JA鈴鹿", parent: "三重県" },

    { value: "JAこうか", parent: "滋賀県" },
    { value: "JAグリーン近江", parent: "滋賀県" },
    { value: "JAレーク伊吹", parent: "滋賀県" },
    { value: "JAレーク滋賀", parent: "滋賀県" },
    { value: "JA北びわこ", parent: "滋賀県" },
    { value: "JA東びわこ", parent: "滋賀県" },
    { value: "JA東能登川", parent: "滋賀県" },
    { value: "JA湖東", parent: "滋賀県" },
    { value: "JA滋賀蒲生町", parent: "滋賀県" },

    { value: "JA京都", parent: "京都府" },
    { value: "JA京都にのくに", parent: "京都府" },
    { value: "JA京都やましろ", parent: "京都府" },
    { value: "JA京都中央", parent: "京都府" },
    { value: "JA京都市", parent: "京都府" },

    { value: "JAいずみの", parent: "大阪府" },
    { value: "JAたかつき", parent: "大阪府" },
    { value: "JAグリーン大阪", parent: "大阪府" },
    { value: "JA九個荘", parent: "大阪府" },
    { value: "JA北大阪", parent: "大阪府" },
    { value: "JA北河内", parent: "大阪府" },
    { value: "JA堺市", parent: "大阪府" },
    { value: "JA大阪中河内", parent: "大阪府" },
    { value: "JA大阪北部", parent: "大阪府" },
    { value: "JA大阪南", parent: "大阪府" },
    { value: "JA大阪市", parent: "大阪府" },
    { value: "JA大阪東部", parent: "大阪府" },
    { value: "JA大阪泉州", parent: "大阪府" },
    { value: "JA茨木市", parent: "大阪府" },

    { value: "JAならけん", parent: "奈良県" },

    { value: "JAありだ", parent: "和歌山県" },
    { value: "JAながみね", parent: "和歌山県" },
    { value: "JAみくまの", parent: "和歌山県" },
    { value: "JAわかやま", parent: "和歌山県" },
    { value: "JA紀の里", parent: "和歌山県" },
    { value: "JA紀北かわかみ", parent: "和歌山県" },
    { value: "JA紀南", parent: "和歌山県" },
    { value: "JA紀州", parent: "和歌山県" },

    { value: "JAあいおい", parent: "兵庫県" },
    { value: "JAあかし", parent: "兵庫県" },
    { value: "JAあわじ島", parent: "兵庫県" },
    { value: "JAたじま", parent: "兵庫県" },
    { value: "JAみのり", parent: "兵庫県" },
    { value: "JAハリマ", parent: "兵庫県" },
    { value: "JA丹波ささやま", parent: "兵庫県" },
    { value: "JA丹波ひかみ", parent: "兵庫県" },
    { value: "JA兵庫みらい", parent: "兵庫県" },
    { value: "JA兵庫六甲", parent: "兵庫県" },
    { value: "JA兵庫南", parent: "兵庫県" },
    { value: "JA兵庫西", parent: "兵庫県" },
    { value: "JA加古川南", parent: "兵庫県" },
    { value: "JA淡路日の出", parent: "兵庫県" },

    { value: "JA鳥取いなば", parent: "鳥取県" },
    { value: "JA鳥取中央", parent: "鳥取県" },
    { value: "JA鳥取西部", parent: "鳥取県" },

    { value: "JA岡山", parent: "岡山県" },
    { value: "JA晴れの国岡山", parent: "岡山県" },

    { value: "JAしまね", parent: "島根県" },

    { value: "JA三原", parent: "広島県" },
    { value: "JA三次", parent: "広島県" },
    { value: "JA佐伯中央", parent: "広島県" },
    { value: "JA呉", parent: "広島県" },
    { value: "JA安芸", parent: "広島県" },
    { value: "JA尾道市", parent: "広島県" },
    { value: "JA広島ゆたか", parent: "広島県" },
    { value: "JA広島中央", parent: "広島県" },
    { value: "JA広島北部", parent: "広島県" },
    { value: "JA広島市", parent: "広島県" },
    { value: "JA庄原", parent: "広島県" },
    { value: "JA福山市", parent: "広島県" },
    { value: "JA芸南", parent: "広島県" },

    { value: "JA山口県", parent: "山口県" },

    { value: "JA香川県", parent: "香川県" },

    { value: "JAあわ市", parent: "徳島県" },
    { value: "JAかいふ", parent: "徳島県" },
    { value: "JAアグリあなん", parent: "徳島県" },
    { value: "JA名西郡", parent: "徳島県" },
    { value: "JA大津松茂", parent: "徳島県" },
    { value: "JA徳島北", parent: "徳島県" },
    { value: "JA徳島市", parent: "徳島県" },
    { value: "JA東とくしま", parent: "徳島県" },
    { value: "JA板野郡", parent: "徳島県" },
    { value: "JA美馬", parent: "徳島県" },
    { value: "JA里浦", parent: "徳島県" },
    { value: "JA阿波みよし", parent: "徳島県" },
    { value: "JA麻植郡", parent: "徳島県" },

    { value: "JA土佐くろしお", parent: "高知県" },
    { value: "JA馬路村", parent: "高知県" },
    { value: "JA高知市", parent: "高知県" },
    { value: "JA高知県", parent: "高知県" },

    { value: "JAうま", parent: "愛媛県" },
    { value: "JAえひめ中央", parent: "愛媛県" },
    { value: "JAえひめ南", parent: "愛媛県" },
    { value: "JAえひめ未来", parent: "愛媛県" },
    { value: "JAおちいまばり", parent: "愛媛県" },
    { value: "JAにしうわ", parent: "愛媛県" },
    { value: "JAひがしうわ", parent: "愛媛県" },
    { value: "JA今治立花", parent: "愛媛県" },
    { value: "JA周桑", parent: "愛媛県" },
    { value: "JA愛媛たいき", parent: "愛媛県" },
    { value: "JA松山市", parent: "愛媛県" },

    { value: "JAくるめ", parent: "福岡県" },
    { value: "JAたがわ", parent: "福岡県" },
    { value: "JAにじ", parent: "福岡県" },
    { value: "JAにじ", parent: "福岡県" },
    { value: "JAふくおか八女", parent: "福岡県" },
    { value: "JAふくおか嘉穂", parent: "福岡県" },
    { value: "JAみい", parent: "福岡県" },
    { value: "JAみづま", parent: "福岡県" },
    { value: "JAみなみ筑後", parent: "福岡県" },
    { value: "JAむなかた", parent: "福岡県" },
    { value: "JA北九", parent: "福岡県" },
    { value: "JA柳川", parent: "福岡県" },
    { value: "JA直鞍", parent: "福岡県" },
    { value: "JA福岡京築", parent: "福岡県" },
    { value: "JA福岡大城", parent: "福岡県" },
    { value: "JA福岡市", parent: "福岡県" },
    { value: "JA福岡市東部", parent: "福岡県" },
    { value: "JA筑前あさくら", parent: "福岡県" },
    { value: "JA筑紫", parent: "福岡県" },
    { value: "JA粕屋", parent: "福岡県" },
    { value: "JA糸島", parent: "福岡県" },

    { value: "JAおおいた", parent: "大分県" },
    { value: "JAべっぷ日出", parent: "大分県" },
    { value: "JA下郷", parent: "大分県" },
    { value: "大分大山町農協", parent: "大分県" },

    { value: "JAからつ", parent: "佐賀県" },
    { value: "JAさが", parent: "佐賀県" },
    { value: "JA伊万里", parent: "佐賀県" },
    { value: "JA佐賀市中央", parent: "佐賀県" },

    { value: "JAあしきた", parent: "熊本県" },
    { value: "JAあまくさ", parent: "熊本県" },
    { value: "JAかみましき", parent: "熊本県" },
    { value: "JAくま", parent: "熊本県" },
    { value: "JAたまな", parent: "熊本県" },
    { value: "JAやつしろ", parent: "熊本県" },
    { value: "JAれいほく", parent: "熊本県" },
    { value: "JA大浜", parent: "熊本県" },
    { value: "JA本渡五和", parent: "熊本県" },
    { value: "ホンドイツワ", parent: "熊本県" },
    { value: "JA熊本うき", parent: "熊本県" },
    { value: "JA熊本中央会", parent: "熊本県" },
    { value: "JA熊本市", parent: "熊本県" },
    { value: "JA菊池", parent: "熊本県" },
    { value: "JA阿蘇", parent: "熊本県" },
    { value: "JA鹿本", parent: "熊本県" },

    { value: "JAごとう", parent: "長崎県" },
    { value: "JAながさき県央", parent: "長崎県" },
    { value: "JAながさき西海", parent: "長崎県" },
    { value: "JA壱岐市", parent: "長崎県" },
    { value: "JA対馬", parent: "長崎県" },
    { value: "JA島原雲仙", parent: "長崎県" },
    { value: "JA長崎せいひ", parent: "長崎県" },

    { value: "JAえびの市", parent: "宮崎県" },
    { value: "JAこばやし", parent: "宮崎県" },
    { value: "JAはまゆう", parent: "宮崎県" },
    { value: "JA串間市大束", parent: "宮崎県" },
    { value: "JA児湯こゆ", parent: "宮崎県" },
    { value: "JA宮崎中央", parent: "宮崎県" },
    { value: "JA尾鈴", parent: "宮崎県" },
    { value: "JA延岡", parent: "宮崎県" },
    { value: "JA日向", parent: "宮崎県" },
    { value: "JA綾町", parent: "宮崎県" },
    { value: "JA西都", parent: "宮崎県" },
    { value: "JA都城", parent: "宮崎県" },
    { value: "JA高千穂地区", parent: "宮崎県" },

    { value: "JAあいら", parent: "鹿児島県" },
    { value: "JAあおぞら", parent: "鹿児島県" },
    { value: "JAあまみ", parent: "鹿児島県" },
    { value: "JAいぶすき", parent: "鹿児島県" },
    { value: "JAさつま日置", parent: "鹿児島県" },
    { value: "JAそお鹿児島", parent: "鹿児島県" },
    { value: "JA北さつま", parent: "鹿児島県" },
    { value: "JA南さつま", parent: "鹿児島県" },
    { value: "JA種子屋久", parent: "鹿児島県" },
    { value: "JA肝付吾平町", parent: "鹿児島県" },
    { value: "JA鹿児島いずみ", parent: "鹿児島県" },
    { value: "JA鹿児島きもつき", parent: "鹿児島県" },
    { value: "JA鹿児島みらい", parent: "鹿児島県" },

    { value: "JAおきなわ", parent: "沖縄県" },
];
